#!/bin/bash
#!/bin/bash
#########################################注意注意注意注意注意############################################

#蓝色
blue(){
    echo -e "\033[34m\033[01m$1\033[0m"
}
#绿色
green(){
    echo -e "\033[32m\033[01m$1\033[0m"
}
#红色
red(){
    echo -e "\033[31m\033[01m$1\033[0m"
}
#黄色
yellow(){
    echo -e "\033[33m\033[01m$1\033[0m"
}
#天蓝
grey(){
    echo -e "\033[36m\033[01m$1\033[0m"
}
#紫色
purple(){
    echo -e "\033[35m\033[01m$1\033[0m"
}
#白色
white(){
    echo -e "\033[37m\033[01m$1\033[0m"
}
#绿色背景
greenbg(){
    echo -e "\033[43;42m\033[01m $1 \033[0m"
}
#红色背景
redbg(){
    echo -e "\033[37;41m\033[01m $1 \033[0m"
}
#黄色背景
yellowbg(){
    echo -e "\033[33m\033[01m\033[05m[ $1 ]\033[0m"
}

hostname=$(cat /etc/hostname)

# 检查hostname，并修改相关
check_hostname() {
# 获取当前的主机名并显示
     current_hostname=$(hostname)
     echo "当前主机名为: $current_hostname"

# 提示用户输入新的主机名
     read -p "更改主机名称及登录提示信息:" name

# 从 /etc/hosts 文件中提取主机名（考虑改进这部分）
# 假设主机名在第二行
     host=$(awk 'NR==2{split($0, arr, " "); print arr[2]}' /etc/hosts)
     echo "hosts 为：$host"

# 更新 /etc/hosts 文件，将旧的主机名替换为新的主机名
     sudo sed -i "s/$host/$name/g" /etc/hosts

# 设置新的主机名
     sudo hostnamectl set-hostname "$name"

# 更新 /etc/hostname 文件
     echo "$name" | sudo tee /etc/hostname


}

# 检查motd
check_motd() {
    if grep -q "************************************************************************************************\n                                          $hostname\n************************************************************************************************" /etc/motd; then
        red "登录提示信息的主机名已修改"
        read -p "是否要再次修改登录提示信息的主机名？(y/n): " choice
        if [[ $choice == "n" ]]; then
            exit 1
        fi
    else
        change_motd_hostname
    fi
}

# 修改登录提示信息
change_motd_hostname() {

   
   cat << EOF > /etc/motd
------------------------------------------------------------------------------------------------
 ┌───┐   ┌───┬───┬───┬───┐ ┌───┬───┬───┬───┐ ┌───┬───┬───┬───┐ ┌───┬───┬───┐
 │Esc│   │ F1│ F2│ F3│ F4│ │ F5│ F6│ F7│ F8│ │ F9│F10│F11│F12│ │P/S│S L│P/B│  ┌┐    ┌┐    ┌┐
 └───┘   └───┴───┴───┴───┘ └───┴───┴───┴───┘ └───┴───┴───┴───┘ └───┴───┴───┘  └┘    └┘    └┘
 ┌───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───────┐ ┌───┬───┬───┐ ┌───┬───┬───┬───┐
 │~  │! 1│@ 2│# 3│$ 4│% 5│^ 6│& 7│* 8│( 9│) 0│_ -│+ =│ BacSp │ │Ins│Hom│PUp│ │N L│ / │ * │ - │
 ├───┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─────┤ ├───┼───┼───┤ ├───┼───┼───┼───┤
 │ Tab │ Q │ W │ E │ R │ T │ Y │ U │ I │ O │ P │{ [│} ]│ | \ │ │Del│End│PDn│ │ 7 │ 8 │ 9 │   │
 ├─────┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴┬──┴─────┤ └───┴───┴───┘ ├───┼───┼───┤ + │
 │ Caps │ A │ S │ D │ F │ G │ H │ J │ K │ L │: ;│" '│ Enter  │               │ 4 │ 5 │ 6 │   │
 ├──────┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴─┬─┴────────┤     ┌───┐     ├───┼───┼───┼───┤
 │ Shift  │ Z │ X │ C │ V │ B │ N │ M │< ,│> .│? /│  Shift   │     │ ↑ │     │ 1 │ 2 │ 3 │   │
 ├─────┬──┴─┬─┴──┬┴───┴───┴───┴───┴───┴──┬┴───┼───┴┬────┬────┤ ┌───┼───┼───┐ ├───┴───┼───┤ E││
 │ Ctrl│    │Alt │         Space         │ Alt│    │    │Ctrl│ │ ← │ ↓ │ → │ │   0   │ . │←─┘│
 └─────┴────┴────┴───────────────────────┴────┴────┴────┴────┘ └───┴───┴───┘ └───────┴───┴───┘
------------------------------------------------------------------------------------------------

************************************************************************************************
                                          $hostname
************************************************************************************************
EOF

green "登录提示信息的主机名已成功修改"

}

# 主菜单函数
main_menu() {

    check_motd

    read -p "更改已完成。是否要重新启动系统以使更改生效？(y/n): " reboot_choice
    if [ "$reboot_choice" == "y" ]; then
        sudo reboot
    else
        echo "请手动重新启动系统以使更改生效。"
    fi
}

# 主程序
main_menu
